Repository: oelbouha/quickdrop
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# image_uploading
source: Image is still uploading, please wait
ar: يتم تحميل الصورة، يرجى الانتظار
fr: L'image est encore en cours de téléchargement, veuillez patienter

# image_not_selected
source: No image selected
ar: لم يتم اختيار أي صورة
fr: Aucune image sélectionnée

source: Package Details
ar: تفاصيل الطرد
fr: Détails du colis

source: Delivery Locations
ar: مواقع التسليم
fr: Lieux de livraison

source: Package Dimensions
ar: أبعاد الطرد
fr: Dimensions du colis

source: Timing & Image
ar: الوقت والصورة
fr: Horaire et image

source: Update Shipment
ar: تحديث الشحنة
fr: Mettre à jour l'envoi

source: Create Shipment
ar: إنشاء شحنة
fr: Créer un envoi

source: Forgot Password?
ar: هل نسيت كلمة المرور؟
fr: Mot de passe oublié ?

# package_name_required
source: Package name is required
ar: اسم الطرد مطلوب
fr: Le nom du colis est requis

# description_required
source: Description is required
ar: الوصف مطلوب
fr: La description est requise

# package_type_required
source: Package type is required
ar: نوع الطرد مطلوب
fr: Le type de colis est requis

# quantity_required
source: Quantity is required
ar: الكمية مطلوبة
fr: La quantité est requise

# package_name_label
source: Package Name
ar: اسم الطرد
fr: Nom du colis

# package_name_hint
source: e.g., Phone case, Book, Documents
ar: مثلاً: غطاء هاتف، كتاب، وثائق
fr: ex : Coque de téléphone, Livre, Documents

# package_description_label
source: Package Description
ar: وصف الطرد
fr: Description du colis

# package_description_hint
source: Describe your package content in detail...
ar: صف محتوى الطرد بالتفصيل...
fr: Décrivez le contenu de votre colis en détail...

# delivery_price_label
source: Delivery Price (MAD)
ar: سعر التوصيل (درهم)
fr: Prix de livraison (MAD)

# weight_label
source: Weight (kg)
ar: الوزن (كغ)
fr: Poids (kg)

# quantity_label
source: Quantity
ar: الكمية
fr: Quantité

# package_type_label
source: Package Type
ar: نوع الطرد
fr: Type de colis

# package_type_box
source: Box
ar: صندوق
fr: Boîte

# package_type_envelope
source: Envelope
ar: ظرف
fr: Enveloppe

# package_type_bag
source: Bag
ar: حقيبة
fr: Sac

# package_type_pallet
source: Pallet
ar: منصة
fr: Palette

# package_type_accessories
source: Accessories
ar: إكسسوارات
fr: Accessoires

# dimensions_tip_title
source: Accurate measurements help couriers prepare
ar: القياسات الدقيقة تساعد السعاة على التحضير
fr: Des mesures précises aident les livreurs à se préparer

# dimensions_tip_message
source: Providing dimensions ensures better matching and fewer delays.
ar: تحديد الأبعاد بدقة يضمن مطابقة أفضل وتأخيرًا أقل.
fr: Fournir les dimensions garantit une meilleure correspondance et moins de retards.

# request_sent_success
source: Request sent successfully
ar: تم إرسال الطلب بنجاح
fr: Demande envoyée avec succès

# please_complete_all_fields
source: Please complete all required fields
ar: يرجى ملء جميع الحقول المطلوبة
fr: Veuillez remplir tous les champs requis

# please_select_trip
source: Please select a trip
ar: يرجى اختيار رحلة
fr: Veuillez sélectionner un voyage

# selected_trip_invalid
source: Selected trip is invalid
ar: الرحلة المحددة غير صالحة
fr: Le voyage sélectionné n'est pas valide

source: Send Request
ar: إرسال الطلب
fr: Envoyer la demande

source: Send Offer
ar: إرسال العرض
fr: Envoyer l'offre

source: Choose a trip
ar: اختر رحلة
fr: Choisissez un voyage

# no_active_trips_available
source: No active trips match this shipment's destination
ar: لا توجد رحلات نشطة تطابق وجهة هذه الشحنة
fr: Aucun voyage actif ne correspond à la destination de ce colis

source: Add a note
ar: إضافة ملاحظة
fr: Ajouter une note

source: Starting from
ar: يبدأ من
fr: À partir de

source: Note
ar: ملاحظة

source: Route
ar: المسار
fr: Itinéraire

source: Package Image
ar: صورة الطرد
fr: Image du colis

# error_fetch_requests
source: Failed to fetch requests: {error}
ar: فشل في جلب الطلبات: {error}
fr: Échec de récupération des demandes : {error}

source: Error loading conversations
ar: خطأ في تحميل المحادثات
fr: Erreur lors du chargement des conversations

source: No active negotiations
ar: لا توجد مفاوضات نشطة
fr: Aucune négociation active

# no_active_negotiations_subtitle
source: Start negotiating on delivery requests to see them here
ar: ابدأ التفاوض على طلبات التوصيل لرؤيتها هنا
fr: Commencez à négocier les demandes de livraison pour les voir ici

source: No messages yet
ar: لا توجد رسائل بعد
fr: Pas encore de messages

source: Guest
ar: زائر
fr: Invité

source: No Delivery requests
ar: لا توجد طلبات توصيل
fr: Aucune demande de livraison

# no_delivery_requests_subtitle
source: Incoming delivery requests will show up here
ar: ستظهر طلبات التوصيل الواردة هنا
fr: Les demandes de livraison entrantes apparaîtront ici

source: No delivery requests sent
ar: لم يتم إرسال أي طلبات توصيل
fr: Aucune demande de livraison envoyée

# no_delivery_requests_sent_subtitle
source: Requests you've sent to others will appear here
ar: الطلبات التي أرسلتها للآخرين ستظهر هنا
fr: Les demandes que vous avez envoyées aux autres apparaîtront ici

# request_refused_success
source: Request refused successfully
ar: تم رفض الطلب بنجاح
fr: Demande refusée avec succès

# request_refused_failed
source: Failed to refuse request
ar: فشل رفض الطلب
fr: Échec du refus de la demande

# request_accepted_success
source: Request accepted successfully
ar: تم قبول الطلب بنجاح
fr: Demande acceptée avec succès

# request_accepted_failed
source: Failed to accept request
ar: فشل قبول الطلب
fr: Échec de l'acceptation de la demande

source: New Delivery Request
ar: طلب توصيل جديد
fr: Nouvelle demande de livraison

source: Offered Price
ar: السعر المعروض
fr: Prix proposé

# request_refused_failed_with_error
source: Failed to refuse request {error}
ar: فشل رفض الطلب: {error}
fr: Échec du refus de la demande : {error}

source: Negotiation in progress
ar: جاري التفاوض
fr: Négociation en cours

source: Cancelling...
ar: جارٍ الإلغاء...
fr: Annulation...

source: Cancel Negotiation
ar: إلغاء التفاوض
fr: Annuler la négociation

# driver_registration_confirm_message
source: Are you sure all information is correct!
ar: هل أنت متأكد أن جميع المعلومات صحيحة!
fr: Êtes-vous sûr que toutes les informations sont correctes !

# driver_registration_confirm_header
source: Register Request
ar: طلب التسجيل
fr: Demande d'inscription

source: confirm
ar: تأكيد
fr: Confirmer

# driver_mode_title
source: Driver Mode
ar: وضع السائق
fr: Mode Conducteur

# driver_mode_success_message
source: Your request has been sent Successfully. We will update you after review your documents
ar: تم إرسال طلبك بنجاح. سنقوم بتحديثك بعد مراجعة مستنداتك
fr: Votre demande a été envoyée avec succès. Nous vous informerons après vérification de vos documents

# driver_mode_request_failed
source: Failed to send request please try again later
ar: فشل إرسال الطلب، يرجى المحاولة لاحقًا
fr: Échec de l'envoi de la demande, veuillez réessayer plus tard

source: Please fill all fields
ar: يرجى ملء جميع الحقول
fr: Veuillez remplir tous les champs

source: Registration
ar: التسجيل
fr: Inscription

# request_driver_mode_title
source: Request Driver Mode
ar: طلب وضع السائق
fr: Demander le mode conducteur

# request_driver_mode_message
source: You have been requested to become a driver. please wait for the admin to review your request. You will be notified once your request is approved.
ar: تم طلبك لتصبح سائقًا. يرجى الانتظار حتى يقوم المسؤول بمراجعة طلبك. سيتم إعلامك بمجرد الموافقة.
fr: Vous avez été invité à devenir conducteur. Veuillez attendre que l'administrateur examine votre demande. Vous serez notifié une fois approuvé.

source: Resend Request
ar: إعادة إرسال الطلب
fr: Renvoyer la demande

source: Driver registration
ar: تسجيل السائق
fr: Inscription conducteur

# driver_registration_subtitle
source: You can request to become a driver by filling out the form below.
ar: يمكنك طلب أن تصبح سائقًا عن طريق ملء النموذج أدناه.
fr: Vous pouvez demander à devenir conducteur en remplissant le formulaire ci-dessous.

source: Upload Image
ar: رفع صورة
fr: Téléverser une image

# id_card_number
source: Id cart number
ar: رقم بطاقة الهوية
fr: Numéro de carte d'identité

# enter_national_id
source: Enter your National ID
ar: أدخل رقم الهوية الوطنية
fr: Entrez votre carte d'identité nationale

source: vehicle Information
ar: معلومات المركبة
fr: Informations sur le véhicule

# registration_plate
source: Rgistration plate
ar: رقم اللوحة
fr: Plaque d'immatriculation

# vehicle_plate_number_hint
source: vehicle plate number
ar: رقم لوحة المركبة
fr: Numéro de plaque du véhicule

# driver_number_label
source: Driver number
ar: رقم السائق
fr: Numéro du conducteur

# driver_number_hint
source: (e.g. 00125)
ar: (مثال: 00125)
fr: (ex. 00125)

# vehicle_type_label
source: Vehicle Type
ar: نوع المركبة
fr: Type de véhicule

# vehicle_type_hint
source: vehicle type (car, truck, etc.)
ar: نوع المركبة (سيارة، شاحنة، إلخ)
fr: Type de véhicule (voiture, camion, etc.)

# vehicle_info_note
source: Make sure the vehicle information matches your vehicle registration documents.
ar: تأكد من أن معلومات المركبة تتطابق مع مستندات تسجيل المركبة.
fr: Assurez-vous que les informations du véhicule correspondent aux documents d'immatriculation.

source: Registering
ar: جاري التسجيل
fr: Inscription en cours

source: Register
ar: تسجيل
fr: S'inscrire

# payment_start_journey
source: Start Your Journey
ar: ابدأ رحلتك
fr: Commencez votre aventure

# payment_join_drivers
source: Join thousands of drivers earning daily
ar: انضم إلى آلاف السائقين الذين يربحون يوميًا
fr: Rejoignez des milliers de conducteurs qui gagnent chaque jour

# payment_how_it_works
source: How it works
ar: كيف تعمل
fr: Comment ça marche

# payment_step_1
source: Subscribe for this month and start earning
ar: اشترك لهذا الشهر وابدأ في الربح
fr: Abonnez-vous pour ce mois et commencez à gagner

# payment_step_2
source: Work when you want, earn as you like
ar: اعمل وقتما تشاء واربح كما تريد
fr: Travaillez quand vous voulez, gagnez comme vous le souhaitez

# payment_step_3
source: Only 50 dh per month to stay active
ar: فقط 50 درهم في الشهر للبقاء نشطًا
fr: Seulement 50 dh par mois pour rester actif

# payment_step_4
source: Renew monthly, no commitments
ar: جدد شهريًا، بدون التزامات
fr: Renouvelez chaque mois, sans engagement

# payment_free_trial_badge
source: 1 MONTH FREE TRIAL
ar: تجربة مجانية لمدة شهر واحد
fr: 1 MOIS D’ESSAI GRATUIT

# payment_monthly_subscription
source: Monthly Subscription
ar: اشتراك شهري
fr: Abonnement mensuel

# payment_price
source: dh
ar: درهم

# payment_price_period
source: /month
ar: /شهر
fr: /mois

# payment_first_month_free
source: First month FREE, then 50 dh/month
ar: الشهر الأول مجاني، ثم 50 درهم/شهريًا
fr: Premier mois GRATUIT, puis 50 dh/mois

# payment_terms_agree
source: I agree to the
ar: أوافق على
fr: J’accepte les

# payment_terms_of_service
source: Terms of Service
ar: شروط الخدمة
fr: Conditions d’utilisation

# payment_terms_and
source: and
ar: و
fr: et la

# payment_privacy_policy
source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Pay
ar: ادفع
fr: Payer

# payment_secure_stripe
source: Secure payment powered by Stripe
ar: دفع آمن عبر Stripe
fr: Paiement sécurisé propulsé par Stripe

# payment_subscription_activated
source: Subscription activated!
ar: تم تفعيل الاشتراك!
fr: Abonnement activé !

source: Payment failed
ar: فشل الدفع
fr: Échec du paiement

source: Payment error
ar: حدث خطأ في الدفع
fr: Erreur de paiement

# payment_not_signed_in
source: Not signed in
ar: لم يتم تسجيل الدخول
fr: Non connecté

# payment_function_error
source: Test error
ar: خطأ في الاختبار
fr: Erreur de test

# payment_test_function
source: Testing function...
ar: جارٍ اختبار الوظيفة...
fr: Test de la fonction...

# payment_calling_intent
source: Calling createPaymentIntent...
ar: يتم الآن إنشاء طلب الدفع...
fr: Appel de createPaymentIntent...

# payment_user_label
source: User
ar: المستخدم
fr: Utilisateur

# payment_function_returned
source: Function returned
ar: تم إرجاع الوظيفة
fr: Fonction retournée

# profile_title
source: Profile
ar: الملف الشخصي
fr: Profil

# profile_shipments_overview
source: Shipments Overview
ar: نظرة عامة على الشحنات
fr: Aperçu des livraisons

# profile_trips_overview
source: Trips Overview
ar: نظرة عامة على الرحلات
fr: Aperçu des trajets

# profile_pending
source: Pending
ar: قيد الانتظار
fr: En attente

# profile_ongoing
source: Ongoing
ar: جاري التنفيذ
fr: En cours

# profile_completed
source: Completed
ar: مكتمل
fr: Terminé

# profile_reviews
source: Reviews
ar: التقييمات
fr: Avis

# profile_no_reviews_yet
source: No Reviews Yet
ar: لا توجد تقييمات بعد
fr: Aucun avis pour le moment

# profile_joined
source: Joined
ar: انضم
fr: Inscrit

# profile_guest_user
source: Guest User
ar: مستخدم زائر
fr: Utilisateur invité

# profile_year_singular
source: year
ar: سنة
fr: an

# profile_year_plural
source: years
ar: سنوات
fr: ans

# profile_month_singular
source: month
ar: شهر
fr: mois

# profile_month_plural
source: months
ar: أشهر
fr: mois

# profile_day_singular
source: day
ar: يوم
fr: jour

# profile_day_plural
source: days
ar: أيام
fr: jours

# profile_hour_singular
source: hour
ar: ساعة
fr: heure

# profile_hour_plural
source: hours
ar: ساعات
fr: heures

# profile_minute_singular
source: minute
ar: دقيقة

# profile_minute_plural
source: minutes
ar: دقائق

# profile_just_now
source: just now
ar: الآن
fr: à l'instant

# profile_ago
source: ago
ar: منذ
fr: il y a

# profile_statistics_not_found
source: Statistics not found for user
ar: لم يتم العثور على إحصاءات للمستخدم
fr: Statistiques introuvables pour l'utilisateur

# profile_error_fetching_data
source: Error fetching user data
ar: خطأ في جلب بيانات المستخدم
fr: Erreur lors de la récupération des données de l'utilisateur

# profile_error_message
source: Error fetching user data:
ar: خطأ في جلب بيانات المستخدم:
fr: Erreur lors de la récupération des données de l'utilisateur :

# mark_as_delivered_title
source: Mark as Delivered
ar: تحديد كـ تمّ التسليم
fr: Marquer comme livré

# confirm_delivery_message
source: Are you sure this item has been delivered successfully?
ar: هل أنت متأكد أن هذا الطرد تم تسليمه بنجاح؟
fr: Êtes-vous sûr que cet article a été livré avec succès ?

# courier_label
source: Courier
ar: الموصل
fr: Livreur

# price_label_dh
source: Price
ar: السعر
fr: Prix

# delivery_complete_rating_info
source: This will complete the delivery and you'll be asked to rate the courier.
ar: سيتم إنهاء عملية التسليم وسيُطلب منك تقييم الموصل.
fr: Cela terminera la livraison et vous serez invité à évaluer le livreur.

source: Not Yet
ar: ليس بعد
fr: Pas encore

# mark_delivered_button
source: Mark Delivered
ar: تحديد كـ تمّ التسليم
fr: Marquer comme livré

# cancel_delivery_title
source: Cancel Delivery
ar: إلغاء التسليم
fr: Annuler la livraison

# confirm_cancel_delivery_message
source: Are you sure you want to cancel this ongoing delivery?
ar: هل أنت متأكد أنك تريد إلغاء عملية التسليم الجارية؟
fr: Êtes-vous sûr de vouloir annuler cette livraison en cours ?

# cancel_warning_message
source: Please contact the courier before canceling to avoid any issues.
ar: يرجى التواصل مع الموصل قبل الإلغاء لتجنب أي مشاكل.
fr: Veuillez contacter le livreur avant d'annuler afin d'éviter tout problème.

# keep_active_button
source: Keep Active
ar: ابقاء نشطًا
fr: Garder actif

# cancel_delivery_button
source: Cancel Delivery
ar: إلغاء التسليم
fr: Annuler la livraison

# your_courier_label
source: Your Courier
ar: الموصل الخاص بك
fr: Votre livreur

# chat_button
source: Chat
ar: محادثة
fr: Discuter

# delivered_button
source: Delivered
ar: تمّ التسليم
fr: Livré

# courier
source: Your Courier
ar: الموصل الخاص بك
fr: Votre livreur

source: Review
ar: مراجعة
fr: Avis

# review_submitted_success
source: Review Submitted succesfully!
ar: تم إرسال التقييم بنجاح!
fr: Avis envoyé avec succès !

# review_submit_failed
source: Failed to submit review
ar: فشل في إرسال التقييم
fr: Échec de l'envoi de l'avis

# rate_experience_title
source: Rate your experience
ar: قيّم تجربتك
fr: Évaluez votre expérience

# rate_experience_subtitle
source: Please rate your experience with the user and provide feedback
ar: يرجى تقييم تجربتك مع المستخدم وترك ملاحظاتك
fr: Veuillez évaluer votre expérience avec l'utilisateur et donner votre avis

# review_hint_text
source: Share your thoughts
ar: شارك أفكارك
fr: Partagez vos impressions

# submit_review_button
source: Submit Review
ar: إرسال التقييم
fr: Envoyer l'avis

# report_describe_problem
source: Please describe the problem before submitting.
ar: يرجى وصف المشكلة قبل الإرسال.
fr: Veuillez décrire le problème avant de soumettre.

# report_submitted_success
source: Problem reported successfully!
ar: تم الإبلاغ عن المشكلة بنجاح!
fr: Problème signalé avec succès !

# report_submit_failed
source: Failed to submit report
ar: فشل في إرسال البلاغ
fr: Échec de l'envoi du signalement

# report_problem_title
source: Report a Problem
ar: الإبلاغ عن مشكلة
fr: Signaler un problème

# report_problem_subtitle
source: Please describe the issue you encountered with this user
ar: يرجى وصف المشكلة التي واجهتها مع هذا المستخدم
fr: Veuillez décrire le problème rencontré avec cet utilisateur

# report_hint_text
source: Describe the problem...
ar: صف المشكلة...
fr: Décrivez le problème...

# submit_report_button
source: Submit Report
ar: إرسال البلاغ
fr: Soumettre le rapport

source: Waiting for response
ar: في انتظار الرد
fr: En attente de réponse

source: Type a message
ar: اكتب رسالة
fr: Tapez un message

source: Seen
ar: تمت المشاهدة
fr: Vu

# error_loading_message
source: Error loading messages
ar: حدث خطأ أثناء تحميل الرسائل
fr: Erreur lors du chargement des messages

# error_loading_message_text
source: Failed to load messages. Please try again later.
ar: فشل في تحميل الرسائل. يرجى المحاولة لاحقًا.
fr: Échec du chargement des messages. Veuillez réessayer plus tard.

# security_delete_account_confirm
source: Are you sure you want to delete your Account?
ar: هل أنت متأكد أنك تريد حذف حسابك؟
fr: Êtes-vous sûr de vouloir supprimer votre compte ?

# security_delete_account_title
source: Delete Account
ar: حذف الحساب
fr: Supprimer le compte

# security_confirm_button
source: Confirm
ar: تأكيد
fr: Confirmer

# security_delete_success_title
source: Account Deleted Successfully!
ar: تم حذف الحساب بنجاح!
fr: Compte supprimé avec succès !

# security_delete_success_message
source: Your account and data has been deleted successfully.
ar: تم حذف حسابك وبياناتك بنجاح.
fr: Votre compte et vos données ont été supprimés avec succès.

# security_profile_settings_title
source: Profile Settings
ar: إعدادات الملف الشخصي
fr: Paramètres du profil

# security_delete_account_subtitle
source: Delete your account permanently
ar: احذف حسابك نهائيًا
fr: Supprimez votre compte de façon permanente

# security_change_language_subtitle
source: Change your language preference
ar: تغيير تفضيلات اللغة
fr: Modifier vos préférences linguistiques

# change_language_title
source: Language
ar: اللغة
fr: Langue

# delete_shipment_title
source: Delete Shipment
ar: حذف الشحنة
fr: Supprimer l'expédition

source: Delete
ar: حذف
fr: Supprimer

# action_cannot_be_undone
source: This action cannot be undone. Are you sure?
ar: لا يمكن التراجع عن هذا الإجراء. هل أنت متأكد؟
fr: Cette action ne peut pas être annulée. Êtes-vous sûr?

# shipment_deleted
source: Shipment deleted succusfully
ar: تم حذف الشحنة بنجاح
fr: Expédition supprimée avec succès

# shipment_deleted_failed
source: Failed to delete shipment
ar: فشل حذف الشحنة
fr: Échec de la suppression de l'expédition

# error_fetch_trips
source: Failed to fetch Trips: {error}
ar: فشل في جلب الرحلات: {error}
fr: Échec de la récupération des trajets: {error}

# trip_deleted
source: Shipment deleted succusfully
ar: تم حذف الرحلة بنجاح
fr: Trajet supprimé avec succès

# trip_deleted_failed
source: Failed to delete shipment
ar: فشل حذف الرحلة
fr: Échec de la suppression du trajet

# delete_trip_title
source: Delete Trip
ar: حذف الرحلة
fr: Supprimer le trajet

# middle_stop_hint
source: Enter a city you will stop by
ar: أدخل المدينة التي ستتوقف فيها
fr: Entrez une ville où vous ferez une halte

# add_stop
source: Add a stop
ar: إضافة محطة
fr: Ajouter une étape

source: Stop
ar: محطة
fr: Étape

# add_stop_hint
source: You can add optional cities where you’ll stop along the way.
ar: يمكنك إضافة المدن التي ستتوقف فيها أثناء الرحلة (اختياري).
fr: Vous pouvez ajouter des villes où vous ferez une halte pendant le trajet.

# no_result
source: No results
ar: لا توجد نتائج
fr: Aucun résultat

# no_result_message
source: No results found for your search criteria
ar: لم يتم العثور على نتائج تطابق معايير البحث الخاصة بك
fr: Aucun résultat trouvé pour vos critères de recherche

source: New Search
ar: بحث جديد
fr: Nouvelle recherche

source: Max Weight
ar: الوزن الأقصى
fr: Poids maximum

source: Max Price
ar: السعر الأقصى
fr: Prix maximum

source: Type
ar: النوع

source: Kg
ar: كلغ

# dirham
source: dh
ar: درهم

# applied_filtter
source: Applied Filters
ar: الفلاتر المطبقة
fr: Filtres appliqués

# update_failed
source: Failed to update shipment
ar: فشل في تحديث الشحنة
fr: Échec de la mise à jour de l'expédition

source: In progress
ar: قيد التقدم
fr: En cours

source: Stops
ar: محطات
fr: Arrêts

source: More
ar: المزيد
fr: Plus

source: Loading...
ar: جاري التحميل...
fr: Chargement...

source: ⭐ No rating
ar: ⭐ لا يوجد تقييم
fr: ⭐ Aucune note

source: ⭐ No rating yet
ar: ⭐ لا يوجد تقييم بعد
fr: ⭐ Pas encore de note

# rating
source: ⭐ {rating} rating
ar: ⭐ تقييم {rating}
fr: ⭐ Note de {rating}

source: Email not verified
ar: البريد الإلكتروني غير مؤكد
fr: Email non vérifié

# please_verify_email
source: Please verify your email address to access all features
ar: يرجى تأكيد عنوان بريدك الإلكتروني للوصول إلى جميع الميزات
fr: Veuillez vérifier votre adresse email pour accéder à toutes les fonctionnalités

source: Send verification email
ar: إرسال بريد التحقق
fr: Envoyer l'email de vérification

# verification_email_sent
source: A verification link has been sent to your new email address. Please check your inbox.
ar: تم إرسال رابط التحقق إلى بريدك الإلكتروني الجديد. يرجى التحقق من صندوق الوارد.
fr: Un lien de vérification a été envoyé à votre nouvelle adresse e-mail. Veuillez vérifier votre boîte de réception.

# error_sending_verification
source: Error sending verification email. Please try again
ar: خطأ في إرسال بريد التحقق. يرجى المحاولة مرة أخرى
fr: Erreur lors de l'envoi de l'email de vérification. Veuillez réessayer

# email_verification_note
source: We'll send important updates and notifications to your email address
ar: سنرسل التحديثات والإشعارات المهمة إلى عنوان بريدك الإلكتروني
fr: Nous enverrons les mises à jour importantes et les notifications à votre adresse email

# verify_check_email_title
source: Check your email
ar: تحقق من بريدك الإلكتروني
fr: Vérifiez votre e-mail

# verify_sent_link_message
source: We've sent a verification link to
ar: لقد أرسلنا رابط التحقق إلى
fr: Nous avons envoyé un lien de vérification à

# verify_your_email_placeholder
source: Your email
ar: بريدك الإلكتروني
fr: Votre e-mail

# verify_next_steps_title
source: Next steps
ar: الخطوات التالية
fr: Étapes suivantes

# verify_step_1
source: 1. Check your email inbox
ar: 1. تحقق من صندوق الوارد في بريدك الإلكتروني
fr: 1. Vérifiez votre boîte de réception

# verify_step_2
source: 2. Click the verification link
ar: 2. اضغط على رابط التحقق
fr: 2. Cliquez sur le lien de vérification

# verify_step_3
source: 3. Return here and click "I've verified"
ar: 3. عد إلى هنا واضغط على « تم التحقق »
fr: 3. Revenez ici et cliquez sur « J’ai vérifié »

# verify_button_verified
source: I've verified my email
ar: تم التحقق من بريدي الإلكتروني
fr: J’ai vérifié mon e-mail

# verify_dialog_please_verify_first
source: Please verify your email first.
ar: يرجى التحقق من بريدك الإلكتروني أولاً.
fr: Veuillez d’abord vérifier votre e-mail.
