Repository: oelbouha/quickdrop
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# welcome
source: Welcome Back
ar: مرحبًا بعودتك
fr: Bon retour

# login_title
source: Sign in to continue your shipments
ar: سجّل الدخول لمتابعة شحناتك
fr: Connectez-vous pour continuer vos envois

# signup_title
source: Finish signing up
ar: أكمل التسجيل
fr: Terminez votre inscription

source: Full Name
ar: الاسم الكامل
fr: Nom complet

source: First Name
ar: الاسم الأول
fr: Prénom

source: Last Name
ar: اسم العائلة
fr: Nom

source: Important Note
ar: ملاحظة مهمة
fr: Remarque importante

# signup_note
source: Make sure your name matches your government ID.
ar: تأكد أن اسمك يطابق الاسم في بطاقتك الحكومية.
fr: Assurez-vous que votre nom correspond à celui de votre pièce d’identité officielle.

# enter_phone_number_msg
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف
fr: Veuillez entrer votre numéro de téléphone

source: Join us via phone
ar: انضم إلينا عبر الهاتف
fr: Rejoignez-nous via téléphone

# signup_phone_title
source: W'll text you to confirm your phone number.
ar: سنرسل لك رسالة نصية لتأكيد رقمك.
fr: Nous vous enverrons un SMS pour confirmer votre numéro.

# already_have_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

# intro_title
source: Ship Anywhere
ar: اشحن إلى أي مكان
fr: Envoyez partout

# intro_subtitle
source: Fast, reliable delivery
ar: توصيل سريع وموثوق
fr: Livraison rapide et fiable

# intro_description
source: Connect with trusted travelers and ship your packages.
ar: تواصل مع مسافرين موثوقين لشحن طرودك.
fr: Connectez-vous avec des voyageurs de confiance et expédiez vos colis.

# cntinue
source: Continue
ar: متابعة
fr: Continuer

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

source: or
ar: أو
fr: ou

# dont_have_accout
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n’avez pas de compte ?

source: Login
ar: تسجيل الدخول
fr: Se connecter

source: Sign up
ar: إنشاء حساب
fr: S’inscrire

source: Continue with Google
ar: المتابعة باستخدام Google
fr: Continuer avec Google

# policy
source: By continuing, you agree to our Terms and Privacy Policy
ar: بالمتابعة، فإنك توافق على الشروط وسياسة الخصوصية الخاصة بنا.
fr: En continuant, vous acceptez nos Conditions d’utilisation et notre Politique de confidentialité.

source: Notifications
ar: الإشعارات

# no_notification
source: No Notifications yet
ar: لا توجد إشعارات بعد
fr: Aucune notification pour le moment

source: Pickup Location
ar: موقع الاستلام
fr: Lieu de ramassage

source: Drop-off location
ar: موقع التسليم
fr: Lieu de dépôt

source: Select pickup date
ar: اختر تاريخ الاستلام
fr: Sélectionnez la date de ramassage

source: View details
ar: عرض التفاصيل
fr: Voir les détails

source: Trips
ar: الرحلات
fr: Trajets

source: Shipments
ar: الشحنات
fr: Envois

source: Search
ar: بحث
fr: Rechercher

source: Requests
ar: الطلبات
fr: Demandes

source: Chats
ar: المحادثات
fr: Discussions

source: Active
ar: نشط
fr: Actif

source: Ongoing
ar: جارٍ
fr: En cours

source: Completed
ar: مكتمل
fr: Terminé

source: Send
ar: مرسلة
fr: Envoyé

source: Received
ar: مستلمة
fr: Reçu

source: Negotiate
ar: تفاوض
fr: Négocier

source: Date
ar: التاريخ

source: Weight
ar: الوزن
fr: Poids

# faq
source: Frequently Asked Questions
ar: الأسئلة الشائعة
fr: Foire aux questions

# home_title_part1
source: Ship Anywhere
ar: اشحن إلى أي مكان
fr: Envoyez partout

# home_title_part2
source: Anytime.
ar: في أي وقت.
fr: À tout moment.

# faq_title
source: Frequently Asked Questions
ar: الأسئلة الشائعة
fr: Foire aux questions

# faq_q1
source: How does QuickDrop ensure package safety?
ar: كيف تضمن QuickDrop سلامة الطرود؟
fr: Comment QuickDrop assure-t-il la sécurité des colis ?

# faq_a1
source: All couriers are verified through ID checks and background screening. Every package is insured, tracked in real-time, and handled with care by trusted travelers.
ar: يتم التحقق من هوية جميع السائقين من خلال بطاقات الهوية والفحص الأمني. كل طرد مؤمن عليه ومتابع في الوقت الحقيقي ويتم التعامل معه بعناية.
fr: Tous les coursiers sont vérifiés grâce à des contrôles d’identité et d’antécédents. Chaque colis est assuré, suivi en temps réel et manipulé avec soin par des voyageurs de confiance.

# faq_q2
source: What can I ship with QuickDrop?
ar: ما الذي يمكنني شحنه عبر QuickDrop؟
fr: Que puis-je expédier avec QuickDrop ?

# faq_a2
source: You can ship documents, electronics, clothing, gifts, and most personal items. Prohibited items include hazardous materials, illegal substances, and fragile items without proper packaging.
ar: يمكنك شحن الوثائق والإلكترونيات والملابس والهدايا ومعظم الأغراض الشخصية. المواد المحظورة تشمل المواد الخطرة والممنوعة والأغراض الهشة دون تغليف مناسب.
fr: Vous pouvez envoyer des documents, de l’électronique, des vêtements, des cadeaux et la plupart des objets personnels. Les articles interdits comprennent les matières dangereuses, les substances illégales et les objets fragiles mal emballés.

# faq_q3
source: How much can I save compared to traditional shipping?
ar: كم يمكنني التوفير مقارنة بخدمات الشحن التقليدية؟
fr: Combien puis-je économiser par rapport aux services classiques ?

# faq_a3
source: Users typically save 50-70% compared to major carriers like FedEx or UPS, especially for international shipments. Prices vary based on size, weight, and destination.
ar: يُتيح نموذج التوصيل بين الأفراد عادةً تكاليف أقل بكثير مقارنة بخدمات التوصيل التقليدية في المغرب.
fr: Notre modèle de livraison entre particuliers permet souvent de réduire considérablement les coûts par rapport aux services de livraison traditionnels au Maroc.

# faq_q4
source: How do I become a courier?
ar: كيف أصبح سائق توصيل؟
fr: Comment devenir coursier ?

# faq_a4
source: Simply go to your profile, click on 'Become a Driver', fill your information, wait for approval, and start accepting delivery requests. You set your own prices and schedule.
ar: اذهب إلى ملفك الشخصي، واضغط على 'كن سائقًا'، واملأ معلوماتك، وانتظر الموافقة، ثم ابدأ في قبول الطلبات. يمكنك تحديد أسعارك وجدولك بنفسك.
fr: Allez simplement dans votre profil, cliquez sur 'Devenir conducteur', remplissez vos informations, attendez l’approbation et commencez à accepter des livraisons. Vous fixez vos prix et votre emploi du temps.

# faq_q5
source: What if something goes wrong with my shipment?
ar: ماذا لو حدثت مشكلة في شحنتي؟
fr: Que faire si un problème survient avec mon envoi ?

# faq_a5
source: We provide 24/7 customer support. If there's any issue, our team will resolve it quickly.
ar: نقدم دعمًا فنيًا على مدار الساعة طوال الأسبوع. في حال حدوث مشكلة، سنتعامل معها بسرعة.
fr: Nous offrons une assistance 24h/24 et 7j/7. En cas de problème, notre équipe le résoudra rapidement.

# service_send_title
source: Send Packages
ar: إرسال الطرود
fr: Envoyer des colis

# service_send_description
source: Connect with verified travelers heading to your destination. Save up to 70% on shipping costs with our trusted courier network.
ar: تواصل مع المسافرين الموثوقين المتجهين إلى وجهتك واستمتع بتكاليف شحن أقل من خلال شبكة التوصيل بين الأفراد الموثوقة لدينا.
fr: Connectez-vous avec des voyageurs vérifiés se rendant à votre destination et profitez de coûts de livraison réduits grâce à notre réseau de livraison entre particuliers de confiance.

# service_courier_title
source: Become a Courier
ar: كن سائق توصيل
fr: Devenir coursier

# service_courier_description
source: Turn your trips into earnings. Carry packages and make money on routes you're already taking. Set your own prices and schedule.
ar: حوّل رحلاتك إلى أرباح. انقل الطرود واكسب المال أثناء تنقلك. اختر أسعارك وجدولك بنفسك.
fr: Transformez vos trajets en gains. Transportez des colis et gagnez de l’argent sur vos itinéraires habituels. Fixez vos propres tarifs et horaires.

# feature_tag_1
source: Verified travelers
ar: مسافرون موثوقون
fr: Voyageurs vérifiés

# feature_tag_2
source: No middlemen
ar: بدون وسطاء
fr: Sans intermédiaires

# feature_tag_3
source: Flexible routes
ar: طرق مرنة
fr: Itinéraires flexibles

# feature_tag_4
source: Trusted community
ar: مجتمع موثوق
fr: Communauté de confiance

# settings_language
source: Language
ar: اللغة
fr: Langue

source: Profile
ar: الملف الشخصي
fr: Profil

# no_user_data
source: No user data available
ar: لا توجد بيانات للمستخدم
fr: Aucune donnée utilisateur disponible

source: Guest User
ar: مستخدم زائر
fr: Utilisateur invité

source: Member since
ar: عضو منذ
fr: Membre depuis

# version_info
source: Version 1.0.0 - 2025
ar: الإصدار 1.0.0 - 2025

# settings_logout_confirm_message
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟
fr: Voulez-vous vraiment vous déconnecter ?

# settings_logout_header
source: Log Out
ar: تسجيل الخروج
fr: Déconnexion

# settings_logout_button
source: Log Out
ar: تسجيل الخروج
fr: Se déconnecter

# settings_logout_error
source: Error signing out:
ar: حدث خطأ أثناء تسجيل الخروج:
fr: Erreur de déconnexion :

# feature_coming_soon
source: feature is coming soon!
ar: الميزة قادمة قريبًا!
fr: Fonctionnalité à venir !

# become_driver
source: Become a driver
ar: كن سائقًا
fr: Devenir conducteur

# earn_money
source: Earn money by delivering packages
ar: اكسب المال من خلال توصيل الطرود
fr: Gagnez de l’argent en livrant des colis

source: Refer friends
ar: أوصِ الأصدقاء
fr: Parrainez des amis

# invite_friends
source: Invite friends and earn rewards
ar: ادعُ أصدقاءك واكسب المكافآت
fr: Invitez des amis et gagnez des récompenses

source: Settings
ar: الإعدادات
fr: Paramètres

source: Support
ar: الدعم
fr: Assistance

source: Legal
ar: قانوني
fr: Légal

# personal_info
source: Personal information
ar: المعلومات الشخصية
fr: Informations personnelles

# update_details
source: Update your details and preferences
ar: حدّث بياناتك وتفضيلاتك
fr: Mettez à jour vos informations et préférences

source: Security
ar: الأمان
fr: Sécurité

source: Manage Account
ar: إدارة الحساب
fr: Gérer le compte

# manage_account_preference
source: Manage account preferences
ar: إدارة إعدادات الحساب
fr: Gérer les préférences du compte

# manage_notifications
source: Manage your notification preferences
ar: إدارة إعدادات الإشعارات
fr: Gérer vos préférences de notification

source: Payment methods
ar: طرق الدفع
fr: Moyens de paiement

# manage_payments
source: Add or remove payment methods
ar: أضف أو احذف وسيلة دفع
fr: Ajouter ou supprimer un moyen de paiement

source: Get help
ar: الحصول على المساعدة
fr: Obtenir de l’aide

# contact_support
source: Contact our support team
ar: تواصل مع فريق الدعم
fr: Contacter notre service d’assistance

# terms_service
source: Terms of Service
ar: شروط الخدمة
fr: Conditions d’utilisation

# read_terms
source: Read our terms and conditions
ar: اقرأ الشروط والأحكام
fr: Lire nos conditions d’utilisation

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

# learn_privacy
source: Learn how we protect your data
ar: تعرف على كيفية حماية بياناتك
fr: Découvrez comment nous protégeons vos données

source: Log out
ar: تسجيل الخروج
fr: Déconnexion

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le profil

source: Update Profile
ar: تحديث الملف الشخصي
fr: Mettre à jour le profil

# update_profile_subtitle
source: Keep your information up to date
ar: حافظ على معلوماتك محدثة
fr: Gardez vos informations à jour

source: Profile Image
ar: صورة الملف الشخصي
fr: Photo de profil

source: Change Image
ar: تغيير الصورة
fr: Changer l'image

source: Important
ar: مهم

# profile_image_note
source: Make sure your profile image is clear and recognizable.
ar: تأكد من أن صورتك واضحة وسهلة التعرف.
fr: Assurez-vous que votre photo de profil soit claire et reconnaissable.

source: Personal Information
ar: المعلومات الشخصية
fr: Informations personnelles

# enter_first_name
source: Enter your first name
ar: أدخل اسمك الأول
fr: Entrez votre prénom

# enter_last_name
source: Enter your last name
ar: أدخل اسم العائلة
fr: Entrez votre nom

# personal_info_note
source: Make sure this matches the name on your government ID or passport.
ar: تأكد أن هذا يتطابق مع الاسم في بطاقة الهوية أو جواز السفر.
fr: Assurez-vous que cela correspond au nom figurant sur votre pièce d'identité ou passeport.

source: Contact Information
ar: معلومات الاتصال
fr: Informations de contact

source: Email Address
ar: البريد الإلكتروني
fr: Adresse e-mail

source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

source: Saving...
ar: جارٍ الحفظ...
fr: Enregistrement...

# save_changes_header
source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer les modifications

# save_changes_message
source: Are you sure you want to update your information?
ar: هل أنت متأكد أنك تريد تحديث معلوماتك؟
fr: Êtes-vous sûr de vouloir mettre à jour vos informations ?

# save_button_text
source: Save
ar: حفظ
fr: Enregistrer

# cancel_button_text
source: Cancel
ar: إلغاء
fr: Annuler

# update_success_title
source: Information updated successfully!
ar: تم تحديث المعلومات بنجاح!
fr: Informations mises à jour avec succès !

# update_success_message
source: Your account information has been updated successfully.
ar: تم تحديث معلومات حسابك بنجاح.
fr: Les informations de votre compte ont été mises à jour avec succès.

# update_error_message
source: An error occurred while updating your information. Please try again.
ar: حدث خطأ أثناء تحديث معلوماتك. يرجى المحاولة مرة أخرى.
fr: Une erreur s’est produite lors de la mise à jour de vos informations. Veuillez réessayer.

# image_uploading_message
source: Image is still uploading, please wait
ar: الصورة لا تزال قيد التحميل، يرجى الانتظار
fr: L'image est encore en cours de téléchargement, veuillez patienter

# help_title
source: Help
ar: المساعدة
fr: Aide

source: Still Have Questions?
ar: هل لا تزال لديك أسئلة؟
fr: Vous avez encore des questions ?

source: Helpful Tips
ar: نصائح مفيدة
fr: Astuces utiles

# question_sent_success
source: Question Sent Successfully!
ar: تم إرسال سؤالك بنجاح!
fr: Question envoyée avec succès !

# question_reply_time
source: We'll get back to you within 24 hours.
ar: سنعاود التواصل معك خلال 24 ساعة.
fr: Nous vous répondrons sous 24 heures.

# question_form_info
source: Can't find what you're looking for? Send us your question and our support team will help you out.
ar: لم تجد ما تبحث عنه؟ أرسل لنا سؤالك وسيساعدك فريق الدعم لدينا.
fr: Vous ne trouvez pas ce que vous cherchez ? Envoyez-nous votre question et notre équipe d’assistance vous aidera.

# your_question_label
source: Your Question
ar: سؤالك
fr: Votre question

# question_hint
source: What would you like to know about QuickDrop?
ar: ما الذي ترغب بمعرفته حول QuickDrop؟
fr: Que souhaitez-vous savoir sur QuickDrop ?

source: Send Question
ar: إرسال السؤال
fr: Envoyer la question

source: Sending Question...
ar: جاري إرسال السؤال...
fr: Envoi de la question...

# success_add_question
source: Your question has been added successfully!
ar: تمت إضافة سؤالك بنجاح!
fr: Votre question a été ajoutée avec succès !

# failed_add_question
source: Failed to submit your question
ar: فشل في إرسال السؤال
fr: Échec de l’envoi de la question

# tip_1_title
source: Package Smart
ar: التغليف الذكي
fr: Emballer intelligemment

# tip_1_description
source: Use sturdy boxes and bubble wrap for fragile items. Label clearly with both sender and recipient information.
ar: استخدم صناديق قوية ولف الفقاعات للأغراض الهشة. ضع ملصقًا واضحًا يحتوي على معلومات المرسل والمستلم.
fr: Utilisez des boîtes solides et du papier bulle pour les objets fragiles. Étiquetez clairement avec les informations de l’expéditeur et du destinataire.

# tip_2_title
source: Stay Safe
ar: ابقَ آمنًا
fr: Restez en sécurité

# tip_2_description
source: Always verify courier profiles and ratings before booking. Meet in public places for handoffs when possible.
ar: تحقق دائمًا من ملفات السعاة وتقييماتهم قبل الحجز. قابلهم في أماكن عامة إن أمكن.
fr: Vérifiez toujours les profils et les évaluations des coursiers avant de réserver. Rencontrez-les dans des lieux publics si possible.

# tip_3_title
source: Save More
ar: وفر أكثر
fr: Économisez plus

# tip_3_description
source: Book in advance and be flexible with delivery dates to get the best rates from our courier network.
ar: احجز مسبقًا وكن مرنًا في مواعيد التسليم لتحصل على أفضل الأسعار من شبكة السعاة لدينا.
fr: Réservez à l’avance et soyez flexible sur les dates de livraison pour obtenir les meilleurs tarifs de notre réseau de coursiers.

# tip_4_title
source: Build Trust
ar: ابنِ الثقة
fr: Gagnez la confiance

# tip_4_description
source: Leave honest reviews and maintain good communication with your courier throughout the delivery process.
ar: اترك تقييمات صادقة وحافظ على تواصل جيد مع الساعي طوال عملية التسليم.
fr: Laissez des avis honnêtes et maintenez une bonne communication avec votre coursier pendant tout le processus de livraison.

source: No Ongoing Shipments
ar: لا توجد شحنات جارية
fr: Aucune expédition en cours

# no_ongoing_shipments_subtitle
source: After you create or accept a shipment, it will appear here.
ar: بعد قبولك أو إنشاء شحنة جديدة، ستظهر هنا.
fr: Une fois que vous acceptez ou créez une expédition, elle apparaîtra ici.

source: No Completed Shipments
ar: لا توجد شحنات مكتملة
fr: Aucune expédition terminée

# no_completed_shipments_subtitle
source: Your completed shipments will appear here after delivery.
ar: ستظهر الشحنات المكتملة هنا بعد تسليمها.
fr: Vos expéditions terminées s’afficheront ici après leur livraison.

source: No Active Shipments
ar: لا توجد شحنات نشطة
fr: Aucune expédition active

# no_active_shipments_subtitle
source: Shipments that are currently in progress will show here once started.
ar: ستظهر الشحنات النشطة هنا بعد أن تبدأ العملية.
fr: Les expéditions actuellement en cours apparaîtront ici une fois lancées.

source: No Ongoing trips
ar: لا توجد رحلات جارية
fr: Aucun trajet en cours

# no_ongoing_trips_subtitle
source: After you create or accept a shipment, it will appear here.
ar: بعد إنشاء الرحلة أو قبولها، ستظهر هنا.
fr: Après avoir créé ou accepté un trajet, il apparaîtra ici.

source: No Completed trips
ar: لا توجد رحلات مكتملة
fr: Aucun trajet terminé

# no_completed_trips_subtitle
source: Your completed trips will appear here after delivery.
ar: ستظهر رحلاتك المكتملة هنا بعد التسليم.
fr: Vos trajets terminés apparaîtront ici après la livraison.

source: No Active trips
ar: لا توجد رحلات نشطة
fr: Aucun trajet actif

# no_active_trips_subtitle
source: trips that are currently in progress will show here once started.
ar: ستظهر الرحلات الجارية هنا بمجرد البدء.
fr: Les trajets en cours apparaîtront ici une fois démarrés.

source: Create Trip
ar: إنشاء رحلة
fr: Créer un trajet

source: Update Trip
ar: تحديث الرحلة
fr: Mettre à jour le trajet

source: Processing...
ar: جارٍ المعالجة...
fr: Traitement...

source: Back
ar: رجوع
fr: Retour

source: Trip Details
ar: تفاصيل الرحلة
fr: Détails du trajet

# delivery_price
source: Delivery Price (MAD)
ar: سعر التوصيل (درهم)
fr: Prix de livraison (MAD)

# available_weight
source: Available Weight (kg)
ar: الوزن المتاح (كغ)
fr: Poids disponible (kg)

# pricing_tip_title
source: Pricing Tip
ar: نصيحة التسعير
fr: Conseil sur le prix

# pricing_tip_message
source: Set a competitive price based on distance, package size, and urgency.
ar: حدد سعرًا مناسبًا بناءً على المسافة وحجم الطرد ومستوى الاستعجال.
fr: Fixez un prix compétitif selon la distance, la taille du colis et l'urgence.

source: Trip Locations
ar: مواقع الرحلة
fr: Emplacements du trajet

source: Delivery Location
ar: موقع التسليم
fr: Lieu de livraison

# from_hint
source: From
ar: من
fr: De

# to_hint
source: To
ar: إلى
fr: À

# location_tip_title
source: Location Details Matter
ar: تفاصيل الموقع مهمة
fr: Les détails de localisation sont importants

# location_tip_message
source: Include landmarks, building numbers, and floor details for smoother pickup and delivery.
ar: قم بتضمين المعالم، أرقام المباني، وتفاصيل الطابق لتسهيل الاستلام والتسليم.
fr: Incluez des repères, des numéros de bâtiment et des détails d’étage pour un ramassage et une livraison plus fluides.

source: Timing
ar: الوقت
fr: Horaire

source: Pickup Date
ar: تاريخ الاستلام
fr: Date de ramassage

source: Transport type
ar: نوع النقل
fr: Type de transport

# timing_tip_title
source: Flexible Timing
ar: توقيت مرن
fr: Horaire flexible

# timing_tip_message
source: We'll contact you to confirm the exact pickup time within your preferred date.
ar: سنتواصل معك لتأكيد وقت الاستلام الدقيق في التاريخ الذي تفضله.
fr: Nous vous contacterons pour confirmer l’heure exacte de ramassage à la date que vous préférez.

# trip_list_success_title
source: Trip Listed Successfully!
ar: تم إضافة الرحلة بنجاح!
fr: Trajet ajouté avec succès !

# trip_list_success_message
source: Your trip has been added and is now visible to couriers.
ar: تمت إضافة رحلتك وهي الآن مرئية للمندوبين.
fr: Votre trajet a été ajouté et est maintenant visible pour les livreurs.

# trip_update_success_title
source: Trip Updated Successfully!
ar: تم تحديث الرحلة بنجاح!
fr: Trajet mis à jour avec succès !

# trip_update_success_message
source: Your trip has been updated and is now visible to couriers.
ar: تم تحديث رحلتك وهي الآن مرئية للمندوبين.
fr: Votre trajet a été mis à jour et est maintenant visible pour les livreurs.

# trip_list_failed
source: Failed to list Trip
ar: فشل في إضافة الرحلة
fr: Échec de la création du trajet

# fields_empty
source: Please fill in all required fields
ar: يرجى ملء جميع الحقول المطلوبة
fr: Veuillez remplir tous les champs obligatoires

# login_required
source: Please log in to list a shipment
ar: يرجى تسجيل الدخول لإضافة شحنة
fr: Veuillez vous connecter pour publier un envoi

# pickup_required
source: Pickup location is required
ar: موقع الالتقاط مطلوب
fr: Le lieu de ramassage est requis

# delivery_required
source: Delivery location is required
ar: موقع التسليم مطلوب
fr: Le lieu de livraison est requis

# price_required
source: Price is required
ar: السعر مطلوب
fr: Le prix est requis

# price_number
source: Price must be a number
ar: يجب أن يكون السعر رقمًا
fr: Le prix doit être un nombre

# weight_required
source: Weight is required
ar: الوزن مطلوب
fr: Le poids est requis

# weight_number
source: Weight must be a number
ar: يجب أن يكون الوزن رقمًا
fr: Le poids doit être un nombre

# pickup_date_required
source: Pickup date is required
ar: تاريخ الالتقاط مطلوب
fr: La date de ramassage est requise

# tip_1_step
source: Package Details
ar: تفاصيل الطرد
fr: Détails du colis

# tip_2_step
source: Delivery Locations
ar: مواقع التسليم
fr: Lieux de livraison

# tip_3_step
source: Timing & Image
ar: الوقت والصورة
fr: Horaire et image

# shipment_list_success_title
source: Package Listed Successfully!
ar: تم نشر الطرد بنجاح!
fr: Colis publié avec succès !

# shipment_list_success_message
source: Your shipment has been added and is now visible to couriers.
ar: تمت إضافة شحنتك وهي الآن مرئية للسعاة.
fr: Votre envoi a été ajouté et est maintenant visible par les livreurs.

# shipment_update_success_title
source: Shipment Updated Successfully!
ar: تم تحديث الشحنة بنجاح!
fr: Envoi mis à jour avec succès !

# shipment_update_success_message
source: Your shipment has been updated and is now visible to couriers.
ar: تم تحديث شحنتك وهي الآن مرئية للسعاة.
fr: Votre envoi a été mis à jour et est maintenant visible par les livreurs.

# shipment_list_failed
source: Failed to list shipment: {e}
ar: فشل في نشر الشحنة: {e}
fr: Échec de la publication de l'envoi : {e}

# shipment_update_failed
source: Failed to update shipment: {e}
ar: فشل في تحديث الشحنة: {e}
fr: Échec de la mise à jour de l'envoi : {e}

# image_required
source: Please select an image
ar: يرجى اختيار صورة
fr: Veuillez sélectionner une image

source: Image upload failed
ar: فشل رفع الصورة
fr: Échec du téléchargement de l'image

# image_upload_failed_with_error
source: Image upload failed: {e}
ar: فشل رفع الصورة: {e}
fr: Échec du téléchargement de l'image : {e}
