Repository: oelbouha/quickdrop
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# privacy_changes_content
source: We may update this Privacy Policy periodically. We will notify users of significant changes through the app or email. Your continued use after changes indicates acceptance of the updated policy.
ar: قد نقوم بتحديث سياسة الخصوصية هذه بشكل دوري. سنخطر المستخدمين بالتغييرات المهمة عبر التطبيق أو البريد الإلكتروني. يشير استمرارك في الاستخدام بعد التغييرات إلى قبول السياسة المحدثة.
fr: Nous pouvons mettre à jour cette politique de confidentialité périodiquement. Nous informerons les utilisateurs des modifications importantes via l'application ou par email. Votre utilisation continue après les modifications indique l'acceptation de la politique mise à jour.

# terms_of_service_title
source: Terms of Service
ar: شروط الخدمة
fr: Conditions d'utilisation

# terms_last_updated
source: Last Updated: 2025-24-5
ar: آخر تحديث: 2025-24-5
fr: Dernière mise à jour : 2025-24-5

# terms_acceptance_title
source: 1. Acceptance of Terms
ar: 1. قبول الشروط
fr: 1. Acceptation des conditions

# terms_acceptance_content
source: By accessing and using QuickDrop ("the App", "our Service"), you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to abide by the above, please do not use this service.
ar: من خلال الوصول إلى QuickDrop واستخدامه ("التطبيق"، "خدمتنا")، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية. إذا كنت لا توافق على الالتزام بما سبق، يرجى عدم استخدام هذه الخدمة.
fr: En accédant et en utilisant QuickDrop ("l'Application", "notre Service"), vous acceptez et convenez d'être lié par les termes et dispositions de cet accord. Si vous n'acceptez pas de respecter ce qui précède, veuillez ne pas utiliser ce service.

# terms_description_title
source: 2. Description of Service
ar: 2. وصف الخدمة
fr: 2. Description du service

# terms_description_content
source: QuickDrop is a peer-to-peer package delivery platform that connects users who need packages delivered ("Senders") with users willing to deliver packages ("Carriers"). Our platform facilitates these connections but does not directly provide delivery services.
ar: QuickDrop هي منصة لتوصيل الطرود بين الأفراد تربط المستخدمين الذين يحتاجون إلى توصيل الطرود ("المرسلون") بالمستخدمين الراغبين في توصيل الطرود ("الناقلون"). تسهل منصتنا هذه الاتصالات ولكنها لا تقدم خدمات التوصيل مباشرة.
fr: QuickDrop est une plateforme de livraison de colis entre particuliers qui met en relation les utilisateurs qui ont besoin de colis livrés ("Expéditeurs") avec les utilisateurs prêts à livrer des colis ("Transporteurs"). Notre plateforme facilite ces connexions mais ne fournit pas directement de services de livraison.

# terms_user_responsibilities_title
source: 3. User Responsibilities
ar: 3. مسؤوليات المستخدم
fr: 3. Responsabilités des utilisateurs

# terms_user_responsibilities_content
source: Senders are responsible for: • Accurately describing package contents and dimensions • Ensuring packages comply with local laws and regulations • Proper packaging to prevent damage during transport • Providing accurate pickup and delivery addresses • Paying agreed-upon delivery fees Carriers are responsible for: • Safe and timely delivery of packages • Treating packages with reasonable care • Following delivery instructions • Maintaining valid identification and transportation • Reporting any issues or delays promptly
ar: المرسلون مسؤولون عن: • وصف محتويات وأبعاد الطرد بدقة • التأكد من امتثال الطرود للقوانين واللوائح المحلية • التغليف المناسب لمنع التلف أثناء النقل • توفير عناوين الاستلام والتسليم الدقيقة • دفع رسوم التوصيل المتفق عليها الناقلون مسؤولون عن: • التوصيل الآمن وفي الوقت المناسب للطرود • معاملة الطرود بعناية معقولة • اتباع تعليمات التسليم • الحفاظ على هوية ووسائل نقل صالحة • الإبلاغ عن أي مشاكل أو تأخيرات بسرعة
fr: Les expéditeurs sont responsables de : • Décrire avec précision le contenu et les dimensions des colis • S'assurer que les colis sont conformes aux lois et réglementations locales • Emballer correctement pour éviter les dommages pendant le transport • Fournir des adresses de collecte et de livraison exactes • Payer les frais de livraison convenus Les transporteurs sont responsables de : • Livraison sûre et rapide des colis • Traiter les colis avec un soin raisonnable • Suivre les instructions de livraison • Maintenir une identification et un transport valides • Signaler rapidement tout problème ou retard

# terms_prohibited_items_title
source: 4. Prohibited Items
ar: 4. العناصر المحظورة
fr: 4. Articles interdits

# terms_prohibited_items_content
source: The following items are strictly prohibited on our platform: • Illegal substances or contraband • Hazardous materials (explosives, chemicals, etc.) • Weapons or ammunition • Live animals • Perishable food items without proper packaging • Items exceeding weight/size limits specified in the app • Cash or negotiable instruments • Items that violate intellectual property rights
ar: العناصر التالية محظورة بشكل صارم على منصتنا: • المواد غير القانونية أو المهربة • المواد الخطرة (المتفجرات، المواد الكيميائية، إلخ) • الأسلحة أو الذخيرة • الحيوانات الحية • المواد الغذائية القابلة للتلف بدون تغليف مناسب • العناصر التي تتجاوز حدود الوزن/الحجم المحددة في التطبيق • النقد أو الأدوات القابلة للتداول • العناصر التي تنتهك حقوق الملكية الفكرية
fr: Les articles suivants sont strictement interdits sur notre plateforme : • Substances illégales ou contrebande • Matériaux dangereux (explosifs, produits chimiques, etc.) • Armes ou munitions • Animaux vivants • Denrées périssables sans emballage approprié • Articles dépassant les limites de poids/taille spécifiées dans l'application • Espèces ou instruments négociables • Articles violant les droits de propriété intellectuelle

# terms_liability_title
source: 6. Liability and Insurance
ar: 6. المسؤولية والتأمين
fr: 6. Responsabilité et assurance

# terms_liability_content
source: QuickDrop acts as a platform connecting users and is not liable for: • Loss, damage, or theft of packages • Delays in delivery • Actions or negligence of users • Content or condition of packages Users are encouraged to purchase insurance for valuable items. Our liability is limited to the maximum extent permitted by law.
ar: تعمل QuickDrop كمنصة تربط المستخدمين وليست مسؤولة عن: • فقدان أو تلف أو سرقة الطرود • التأخير في التسليم • تصرفات أو إهمال المستخدمين • محتوى أو حالة الطرود يُشجع المستخدمون على شراء تأمين للعناصر الثمينة. مسؤوليتنا محدودة إلى أقصى حد يسمح به القانون.
fr: QuickDrop agit comme une plateforme connectant les utilisateurs et n'est pas responsable de : • Perte, dommage ou vol de colis • Retards de livraison • Actions ou négligence des utilisateurs • Contenu ou état des colis Les utilisateurs sont encouragés à souscrire une assurance pour les articles de valeur. Notre responsabilité est limitée dans toute la mesure permise par la loi.

# terms_user_conduct_title
source: 7. User Conduct
ar: 7. سلوك المستخدم
fr: 7. Conduite des utilisateurs

# terms_user_conduct_content
source: Users must: • Provide accurate and truthful information • Respect other users and maintain professional conduct • Not use the service for illegal activities • Not attempt to circumvent the platform for direct transactions • Report suspicious activities or policy violations
ar: يجب على المستخدمين: • تقديم معلومات دقيقة وصحيحة • احترام المستخدمين الآخرين والحفاظ على سلوك مهني • عدم استخدام الخدمة للأنشطة غير القانونية • عدم محاولة تجاوز المنصة للمعاملات المباشرة • الإبلاغ عن الأنشطة المشبوهة أو انتهاكات السياسة
fr: Les utilisateurs doivent : • Fournir des informations exactes et véridiques • Respecter les autres utilisateurs et maintenir une conduite professionnelle • Ne pas utiliser le service pour des activités illégales • Ne pas tenter de contourner la plateforme pour des transactions directes • Signaler les activités suspectes ou les violations de politique

# terms_account_termination_title
source: 8. Account Termination
ar: 8. إنهاء الحساب
fr: 8. Résiliation du compte

# terms_account_termination_content
source: We reserve the right to suspend or terminate accounts for violations of these terms, suspicious activity, or other reasons at our sole discretion. Users may close their accounts at any time through the app settings.
ar: نحتفظ بالحق في تعليق أو إنهاء الحسابات لانتهاك هذه الشروط أو النشاط المشبوه أو أسباب أخرى وفقًا لتقديرنا الخاص. يمكن للمستخدمين إغلاق حساباتهم في أي وقت من خلال إعدادات التطبيق.
fr: Nous nous réservons le droit de suspendre ou de résilier des comptes pour violation de ces conditions, activité suspecte ou autres raisons à notre seule discrétion. Les utilisateurs peuvent fermer leurs comptes à tout moment via les paramètres de l'application.

# terms_privacy_title
source: 9. Privacy
ar: 9. الخصوصية
fr: 9. Confidentialité

# terms_privacy_content
source: Your privacy is important to us. Please review our Privacy Policy to understand how we collect, use, and protect your information.
ar: خصوصيتك مهمة بالنسبة لنا. يرجى مراجعة سياسة الخصوصية الخاصة بنا لفهم كيفية جمع معلوماتك واستخدامها وحمايتها.
fr: Votre confidentialité est importante pour nous. Veuillez consulter notre politique de confidentialité pour comprendre comment nous collectons, utilisons et protégeons vos informations.

# terms_modifications_title
source: 10. Modifications
ar: 10. التعديلات

# terms_modifications_content
source: We reserve the right to modify these terms at any time. Users will be notified of significant changes through the app or email. Continued use after modifications constitutes acceptance of the new terms.
ar: نحتفظ بالحق في تعديل هذه الشروط في أي وقت. سيتم إخطار المستخدمين بالتغييرات الهامة عبر التطبيق أو البريد الإلكتروني. يشكل الاستمرار في الاستخدام بعد التعديلات قبولًا للشروط الجديدة.
fr: Nous nous réservons le droit de modifier ces conditions à tout moment. Les utilisateurs seront informés des changements importants via l'application ou par email. L'utilisation continue après les modifications constitue l'acceptation des nouvelles conditions.

# forgot_password_title
source: Forgot Password
ar: هل نسيت كلمة المرور
fr: Mot de passe oublié

# forgot_password_description
source: Enter your email to reset your password.
ar: أدخل بريدك الإلكتروني لإعادة تعيين كلمة المرور الخاصة بك.
fr: Entrez votre adresse e-mail pour réinitialiser votre mot de passe.

# forgot_password_empty_email
source: Please enter your email address.
ar: يرجى إدخال عنوان بريدك الإلكتروني.
fr: Veuillez entrer votre adresse e-mail.

# forgot_password_email_sent
source: Password reset email sent. Please check your inbox.
ar: تم إرسال رسالة إعادة تعيين كلمة المرور. يرجى التحقق من بريدك الوارد.
fr: E-mail de réinitialisation du mot de passe envoyé. Veuillez vérifier votre boîte de réception.

# forgot_password_error
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
fr: Une erreur s'est produite. Veuillez réessayer.

# forgot_password_sending
source: Sending...
ar: جارٍ الإرسال...
fr: Envoi...

# forgot_password_send_email
source: Send Reset Email
ar: إرسال بريد إعادة التعيين
fr: Envoyer l'e-mail de réinitialisation

# too_many_requests
source: Too many requests. Please try again later.
ar: طلبات كثيرة جدًا. يرجى المحاولة لاحقًا.
fr: Trop de requêtes. Veuillez réessayer plus tard.

# email_hint
source: example@gmail.com
fr: exemple@gmail.com
