Repository: oelbouha/quickdrop
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# verify_button_resend
source: Resend verification link
ar: إعادة إرسال رابط التحقق
fr: Renvoyer le lien de vérification

# verify_dialog_email_resent
source: A new email has been sent.
ar: تم إرسال بريد إلكتروني جديد.
fr: Un nouvel e-mail a été envoyé.

# verify_didnt_receive
source: Didn't receive the email? Check your spam folder or contact support
ar: لم يصلك البريد الإلكتروني؟ تحقق من مجلد الرسائل غير المرغوب فيها أو تواصل مع الدعم
fr: Vous n’avez pas reçu l’e-mail ? Vérifiez votre dossier spam ou contactez le support

# reauth_required_message
source: For security reasons, please log in again before changing your email address.
ar: لأسباب أمنية، يرجى تسجيل الدخول مرة أخرى قبل تغيير عنوان البريد الإلكتروني.
fr: Pour des raisons de sécurité, veuillez vous reconnecter avant de modifier votre adresse e-mail.

# invalid_email_message
source: The email address you entered is not valid. Please check and try again.
ar: عنوان البريد الإلكتروني الذي أدخلته غير صالح. يرجى التحقق والمحاولة مرة أخرى.
fr: L’adresse e-mail que vous avez saisie n’est pas valide. Veuillez vérifier et réessayer.

# email_in_use_message
source: This email address is already in use by another account.
ar: عنوان البريد الإلكتروني هذا مستخدم بالفعل من قبل حساب آخر.
fr: Cette adresse e-mail est déjà utilisée par un autre compte.

source: No changes detected.
ar: لم يتم اكتشاف أي تغييرات.
fr: Aucun changement détecté.

source: Car
ar: سيارة
fr: Voiture

source: Motorcycle
ar: دراجة نارية
fr: Moto

source: Truck
ar: شاحنة
fr: Camion

source: Van
ar: شاحنة صغيرة
fr: Fourgonnette

source: Bicycle
ar: دراجة هوائية
fr: Vélo

source: Scooter
ar: سكوتر

source: Box
ar: صندوق
fr: Boîte

source: Envelope
ar: ظرف
fr: Enveloppe

source: Bag
ar: كيس
fr: Sac

source: Pallet
ar: منصة
fr: Palette

source: Accessories
ar: مستلزمات
fr: Accessoires

source: Crate
ar: صندوق خشبي
fr: Caisse

source: Tube
ar: أسطوانة

source: Furniture
ar: أثاث
fr: Meubles

source: Electronics
ar: إلكترونيات
fr: Électronique

source: Clothing
ar: ملابس
fr: Vêtements

# verify_relogin_message
source: After clicking the link in your email, please log out and sign in again with your new email address to complete the update.
ar: بعد النقر على الرابط في بريدك الإلكتروني، يرجى تسجيل الخروج ثم تسجيل الدخول مرة أخرى باستخدام عنوان بريدك الإلكتروني الجديد لإتمام التحديث.
fr: Après avoir cliqué sur le lien dans votre e-mail, veuillez vous déconnecter puis vous reconnecter avec votre nouvelle adresse e-mail pour finaliser la mise à jour.

source: Choose from Gallery
ar: اختر من المعرض
fr: Choisir depuis la galerie

source: Take a Picture
ar: التقط صورة
fr: Prendre une photo

source: Upload photo
ar: تحميل الصورة
fr: Télécharger une photo

# photo_format_hint
source: JPG, PNG up to 5 MB
ar: الصور بصيغ JPG أو PNG، بحجم لا يتجاوز 5 ميغابايت
fr: JPG, PNG jusqu'à 5 Mo

# no_active_shipments_available
source: No active shipments match this trip destination
ar: لا توجد شحنات نشطة تطابق وجهة هذه الشحنة
fr: Aucun voyage actif ne correspond à la destination de ce colis

source: Choose a shipment
ar: اختر شحنة
fr: Choisissez un envoi

# please_select_shipment
source: Please select a shipment
ar: يرجى اختيار شحنة
fr: Veuillez sélectionner un envoi

# request_already_sent
source: You have already sent a request for this shipment. Please wait for the owner to accept or reject it.
ar: لقد أرسلت طلبًا بالفعل لهذا الشحن. يرجى الانتظار حتى يقبل المالك الطلب أو يرفضه.
fr: Vous avez déjà envoyé une demande pour cet envoi. Veuillez attendre que le propriétaire l'accepte ou la rejette.

# trip_owner_cannot_request
source: Trip owner cannot send a request for their own shipment.
ar: لا يمكن لصاحب الرحلة إرسال طلب لشحنه الخاص.
fr: Le propriétaire du trajet ne peut pas envoyer une demande pour son propre envoi.

# driver_cannot_create_trip_message
source: You cannot create a trip right now. Please make sure your driver account is active and verified.
ar: لا يمكنك إنشاء رحلة في الوقت الحالي. يرجى التأكد من أن حساب السائق الخاص بك نشط ومُوثَّق.
fr: Vous ne pouvez pas créer de trajet pour le moment. Veuillez vérifier que votre compte chauffeur est actif et vérifié.

# onboarding_terms_text
source: By continuing, you agree to our Terms of Service
ar: بالمتابعة، فإنك توافق على شروط الخدمة الخاصة بنا
fr: En continuant, vous acceptez nos Conditions d'utilisation

# onboarding_skip
source: Skip
ar: تخطي
fr: Passer

# onboarding_next
source: Next
ar: التالي
fr: Suivant

# onboarding_get_started
source: Get Started
ar: ابدأ الآن
fr: Commencer

# onboarding_1_title
source: Welcome to QuickDrop
ar: مرحباً بك في QuickDrop
fr: Bienvenue sur QuickDrop

# onboarding_1_body
source: Send and receive packages easily with our peer-to-peer delivery system — faster, cheaper, and more personal.
ar: أرسل واستقبل الطرود بسهولة من خلال نظام التوصيل من نظير إلى نظير - أسرع وأرخص وأكثر خصوصية.
fr: Envoyez et recevez des colis facilement avec notre système de livraison entre particuliers — plus rapide, moins cher et plus personnel.

# onboarding_2_title
source: Community-Powered Delivery
ar: التوصيل المجتمعي
fr: Livraison Communautaire

# onboarding_2_body
source: Connect with trusted travelers going your way. They carry your packages safely while earning extra income.
ar: تواصل مع مسافرين موثوقين يسلكون طريقك. ينقلون طرودك بأمان بينما يكسبون دخلاً إضافياً.
fr: Connectez-vous avec des voyageurs de confiance qui vont dans votre direction. Ils transportent vos colis en toute sécurité tout en gagnant un revenu supplémentaire.

# onboarding_3_title
source: Create Shipments & Trips
ar: إنشاء الشحنات والرحلات
fr: Créer des Envois et Trajets

# onboarding_3_body
source: Register once and unlock everything. Create shipment requests or post your travel routes. Negotiate prices and find the perfect match.
ar: سجل مرة واحدة وافتح كل شيء. أنشئ طلبات الشحن أو انشر مسارات سفرك. تفاوض على الأسعار واعثر على التطابق المثالي.
fr: Inscrivez-vous une fois et débloquez tout. Créez des demandes d'envoi ou publiez vos itinéraires de voyage. Négociez les prix et trouvez la correspondance parfaite.

# onboarding_4_title
source: Earn While You Travel
ar: اكسب أثناء سفرك
fr: Gagnez en Voyageant

# onboarding_4_body
source: Deliver packages along your route and get paid instantly. QuickDrop turns every trip into an opportunity.
ar: وصّل الطرود على طول مسارك واحصل على الأموال فوراً. QuickDrop يحول كل رحلة إلى فرصة.
fr: Livrez des colis sur votre trajet et soyez payé instantanément. QuickDrop transforme chaque voyage en opportunité.

source: Pending
ar: قيد الانتظار
fr: En attente

source: Payment
ar: الدفع
fr: Paiement

source: Registration Approved!
ar: تمت الموافقة على التسجيل!
fr: Inscription approuvée !

# registration_approved_message
source: Congratulations! Your driver registration has been approved. Complete the payment to start accepting delivery requests.
ar: تهانينا! تمت الموافقة على تسجيلك كسائق. أكمل الدفع لبدء قبول طلبات التوصيل.
fr: Félicitations ! Votre inscription en tant que chauffeur a été approuvée. Complétez le paiement pour commencer à accepter les demandes de livraison.

source: Subscription Expired
ar: انتهى الاشتراك
fr: Abonnement expiré

# subscription_expired_message
source: Your monthly subscription has expired. Please renew your subscription to continue accepting delivery requests.
ar: انتهى اشتراكك الشهري. يرجى تجديد اشتراكك لمواصلة قبول طلبات التوصيل.
fr: Votre abonnement mensuel a expiré. Veuillez renouveler votre abonnement pour continuer à accepter les demandes de livraison.

# you_are_all_set
source: You're All Set!
ar: أنت جاهز الآن!
fr: Vous êtes prêt !

# you_are_all_set_message
source: Welcome to the driver community! You can now start accepting delivery requests and earning money.
ar: مرحباً بك في مجتمع السائقين! يمكنك الآن البدء في قبول طلبات التوصيل وكسب المال.
fr: Bienvenue dans la communauté des chauffeurs ! Vous pouvez maintenant commencer à accepter les demandes de livraison et gagner de l'argent.

source: Subscription Status
ar: حالة الاشتراك
fr: Statut de l'abonnement

# active_status
source: Active
ar: نشط
fr: Actif

# subscription_active_until
source: Your subscription is active until
ar: اشتراكك نشط حتى
fr: Votre abonnement est actif jusqu'au

# subscription_is_active
source: Your subscription is active
ar: اشتراكك نشط
fr: Votre abonnement est actif

source: What's Next?
ar: ما التالي؟
fr: Quelle est la suite ?

source: Document Verification
ar: التحقق من المستندات
fr: Vérification des documents

# document_verification_desc
source: We'll verify your ID and driver's license
ar: سنتحقق من بطاقة الهوية ورخصة القيادة الخاصة بك
fr: Nous vérifierons votre carte d'identité et votre permis de conduire

source: Vehicle Inspection
ar: فحص المركبة
fr: Inspection du véhicule

# vehicle_inspection_desc
source: Your vehicle details will be verified
ar: سيتم التحقق من تفاصيل مركبتك
fr: Les détails de votre véhicule seront vérifiés

# approval_and_payment
source: Approval & Payment
ar: الموافقة والدفع
fr: Approbation et paiement

# approval_and_payment_desc
source: Once approved, complete payment to activate
ar: بمجرد الموافقة، أكمل الدفع للتفعيل
fr: Une fois approuvé, complétez le paiement pour activer

# you_are_driver_now
source: You are a driver now!
ar: أنت سائق الآن!
fr: Vous êtes maintenant chauffeur !

# you_are_driver_now_message
source: you can send request to others as a driver.
ar: يمكنك الآن إرسال طلبات للآخرين كسائق.
fr: Vous pouvez maintenant envoyer des demandes aux autres en tant que chauffeur.

source: Enter Verification Code
ar: أدخل رمز التحقق
fr: Entrez le code de vérification

# verification_code_sent_to
source: Enter the verification code sent to
ar: أدخل رمز التحقق المرسل إلى
fr: Entrez le code de vérification envoyé à

source: your phone number
ar: رقم هاتفك
fr: votre numéro de téléphone

# enter_valid_code
source: Enter a valid 6-digit code
ar: أدخل رمزًا صالحًا مكونًا من 6 أرقام
fr: Entrez un code valide à 6 chiffres

# invalid_code_error
source: Invalid code. Please try again.
ar: رمز غير صحيح. يرجى المحاولة مرة أخرى.
fr: Code invalide. Veuillez réessayer.

source: Please wait
ar: يرجى الانتظار
fr: Veuillez patienter

# max_retries_reached
source: you reached max tries try again later.
ar: لقد وصلت إلى الحد الأقصى من المحاولات، حاول مرة أخرى لاحقًا.
fr: vous avez atteint le nombre maximum de tentatives, réessayez plus tard.

source: Failed to resend code:
ar: فشل في إعادة إرسال الرمز:
fr: Échec de renvoi du code:

# code_sent_success
source: code was sent , check your inbox.
ar: تم إرسال الرمز، تحقق من صندوق الوارد الخاص بك.
fr: le code a été envoyé, vérifiez votre boîte de réception.

# didnt_receive_code
source: Didn't receive the code?
ar: لم تستلم الرمز؟
fr: Vous n'avez pas reçu le code?

source: Resend code in
ar: إعادة إرسال الرمز في
fr: Renvoyer le code dans

source: seconds
ar: ثانية
fr: secondes

source: Resend code
ar: إعادة إرسال الرمز
fr: Renvoyer le code

source: By clicking
ar: بالنقر على
fr: En cliquant sur

# continue_action
source: Continue,
ar: متابعة،
fr: Continuer,

# agree_to_quickdrop
source: I agree to QuickDrop's
ar: أوافق على
fr: j'accepte les

source: Terms of Service,
ar: شروط الخدمة الخاصة بـ QuickDrop،
fr: Conditions d'utilisation de QuickDrop,

# acknowledge_read
source: and acknowledge that I have read the
ar: وأقر بأنني قرأت
fr: et reconnais avoir lu la

# field_cannot_be_empty
source: This field cannot be empty
ar: هذا الحقل لا يمكن أن يكون فارغًا
fr: Ce champ ne peut pas être vide

# enter_valid_number
source: Enter a valid number
ar: أدخل رقمًا صالحًا
fr: Entrez un numéro valide

# phone_cannot_be_empty
source: Phone number cannot be empty
ar: رقم الهاتف لا يمكن أن يكون فارغًا
fr: Le numéro de téléphone ne peut pas être vide

# enter_valid_phone
source: Enter a valid phone number
ar: أدخل رقم هاتف صالح
fr: Entrez un numéro de téléphone valide

source: Email cannot be empty
ar: البريد الإلكتروني لا يمكن أن يكون فارغًا
fr: L'email ne peut pas être vide

# enter_valid_email
source: Enter a valid email
ar: أدخل بريدًا إلكترونيًا صالحًا
fr: Entrez un email valide

# name_min_length
source: Name must be more than 4 character
ar: يجب أن يكون الاسم أكثر من 4 أحرف
fr: Le nom doit comporter plus de 4 caractères

source: No Conversation yet
ar: لا توجد محادثات بعد
fr: Pas encore de conversation

# chat_empty_message
source: Your chat conversations will appear here once you start messaging
ar: ستظهر محادثاتك هنا بمجرد أن تبدأ بالمراسلة
fr: Vos conversations apparaîtront ici une fois que vous commencerez à envoyer des messages

# share_message
source: 🚀 Check out QuickDrop! Send and receive packages easily. Coming soon to the Play Store — stay tuned!
ar: 🚀 اكتشف تطبيق كويك دروب! أرسل واستقبل الطرود بسهولة. قريبًا على متجر بلاي — ترقبوا!
fr: 🚀 Découvrez QuickDrop ! Envoyez et recevez des colis facilement. Bientôt disponible sur le Play Store — restez à l'écoute !

# share_subject
source: QuickDrop App
ar: تطبيق كويك دروب
fr: Application QuickDrop

# privacy_policy_title
source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

# privacy_last_updated
source: Last Updated: 2025-24-5
ar: آخر تحديث: 2025-24-5
fr: Dernière mise à jour : 2025-24-5

# privacy_introduction_title
source: Introduction
ar: المقدمة

# privacy_introduction_content
source: QuickDrop ("we", "our", or "us") is committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you use our peer-to-peer package delivery mobile application.
ar: تلتزم QuickDrop ("نحن" أو "خاصتنا" أو "لنا") بحماية خصوصيتك. توضح سياسة الخصوصية هذه كيفية جمع معلوماتك واستخدامها والكشف عنها وحمايتها عند استخدام تطبيق الهاتف المحمول الخاص بنا لتوصيل الطرود بين الأفراد.
fr: QuickDrop ("nous", "notre" ou "nos") s'engage à protéger votre vie privée. Cette politique de confidentialité explique comment nous collectons, utilisons, divulguons et protégeons vos informations lorsque vous utilisez notre application mobile de livraison de colis entre particuliers.

# privacy_info_collect_title
source: 1. Information We Collect
ar: 1. المعلومات التي نجمعها
fr: 1. Informations que nous collectons

# privacy_personal_info_title
source: Personal Information:
ar: المعلومات الشخصية:
fr: Informations personnelles :

# privacy_personal_info_content
source: • Name and contact information (email, phone number) • Profile photo and identification documents • Delivery addresses and location data • Device information and unique identifiers
ar: • الاسم ومعلومات الاتصال (البريد الإلكتروني، رقم الهاتف) • صورة الملف الشخصي ووثائق الهوية • عناوين التسليم وبيانات الموقع • معلومات الجهاز والمعرفات الفريدة
fr: • Nom et coordonnées (email, numéro de téléphone) • Photo de profil et documents d'identité • Adresses de livraison et données de localisation • Informations sur l'appareil et identifiants uniques

# privacy_usage_info_title
source: Usage Information:
ar: معلومات الاستخدام:
fr: Informations d'utilisation :

# privacy_usage_info_content
source: • App usage patterns and preferences • Delivery history and transaction records • Communication between users (for safety and quality purposes) • Ratings and reviews
ar: • أنماط استخدام التطبيق والتفضيلات • سجل التسليم وسجلات المعاملات • التواصل بين المستخدمين (لأغراض السلامة والجودة) • التقييمات والمراجعات
fr: • Modèles d'utilisation et préférences de l'application • Historique des livraisons et enregistrements des transactions • Communication entre utilisateurs (à des fins de sécurité et de qualité) • Évaluations et avis

# privacy_how_use_title
source: 2. How We Use Your Information
ar: 2. كيف نستخدم معلوماتك
fr: 2. Comment nous utilisons vos informations

# privacy_how_use_content
source: We use your information to: • Facilitate package deliveries and connect users • Verify user identity and ensure platform safety • Provide customer support and resolve disputes • Improve our services and develop new features • Comply with legal requirements and prevent fraud • Analyze usage patterns to enhance user experience
ar: نستخدم معلوماتك من أجل: • تسهيل توصيل الطرود وربط المستخدمين • التحقق من هوية المستخدم وضمان سلامة المنصة • تقديم دعم العملاء وحل النزاعات • تحسين خدماتنا وتطوير ميزات جديدة • الامتثال للمتطلبات القانونية ومنع الاحتيال • تحليل أنماط الاستخدام لتحسين تجربة المستخدم
fr: Nous utilisons vos informations pour : • Faciliter les livraisons de colis et connecter les utilisateurs • Vérifier l'identité des utilisateurs et assurer la sécurité de la plateforme • Fournir un support client et résoudre les litiges • Améliorer nos services et développer de nouvelles fonctionnalités • Respecter les exigences légales et prévenir la fraude • Analyser les modèles d'utilisation pour améliorer l'expérience utilisateur

# privacy_info_sharing_title
source: 3. Information Sharing
ar: 3. مشاركة المعلومات
fr: 3. Partage des informations

# privacy_info_sharing_content
source: We share your information only in these circumstances: • With other users as necessary for delivery coordination • With payment processors for transaction processing • With service providers who assist our operations • When required by law or legal process • To protect our rights and prevent illegal activities We never sell your personal information to third parties.
ar: نشارك معلوماتك فقط في هذه الظروف: • مع مستخدمين آخرين حسب الحاجة لتنسيق التسليم • مع معالجي الدفع لمعالجة المعاملات • مع مزودي الخدمة الذين يساعدون في عملياتنا • عندما يتطلب القانون أو الإجراءات القانونية ذلك • لحماية حقوقنا ومنع الأنشطة غير القانونية لا نبيع أبدًا معلوماتك الشخصية لأطراف ثالثة.
fr: Nous partageons vos informations uniquement dans ces circonstances : • Avec d'autres utilisateurs si nécessaire pour la coordination des livraisons • Avec les processeurs de paiement pour le traitement des transactions • Avec les prestataires de services qui nous aident dans nos opérations • Lorsque la loi ou une procédure judiciaire l'exige • Pour protéger nos droits et prévenir les activités illégales Nous ne vendons jamais vos informations personnelles à des tiers.

# privacy_data_security_title
source: 4. Data Security
ar: 4. أمن البيانات
fr: 4. Sécurité des données

# privacy_data_security_content
source: We implement industry-standard security measures including: • Encryption of data in transit and at rest • Secure authentication and access controls • Regular security audits and updates • Limited access to personal information by employees However, no method of transmission over the Internet is 100% secure.
ar: نطبق تدابير أمنية معيارية في الصناعة بما في ذلك: • تشفير البيانات أثناء النقل وفي حالة الراحة • المصادقة الآمنة وضوابط الوصول • عمليات التدقيق والتحديثات الأمنية المنتظمة • وصول محدود إلى المعلومات الشخصية من قبل الموظفين ومع ذلك، لا توجد طريقة نقل عبر الإنترنت آمنة بنسبة 100٪.
fr: Nous mettons en œuvre des mesures de sécurité standard de l'industrie, notamment : • Chiffrement des données en transit et au repos • Authentification sécurisée et contrôles d'accès • Audits et mises à jour de sécurité réguliers • Accès limité aux informations personnelles par les employés Cependant, aucune méthode de transmission sur Internet n'est sécurisée à 100%.

# privacy_data_retention_title
source: 5. Data Retention
ar: 5. الاحتفاظ بالبيانات
fr: 5. Conservation des données

# privacy_data_retention_content
source: We retain your information for as long as: • Your account is active • Needed to provide our services • Required by law or for legal proceedings • Necessary for safety and fraud prevention You can request account deletion at any time, though some information may be retained for legal compliance.
ar: نحتفظ بمعلوماتك طالما: • حسابك نشط • مطلوب لتقديم خدماتنا • مطلوب بموجب القانون أو للإجراءات القانونية • ضروري للسلامة ومنع الاحتيال يمكنك طلب حذف الحساب في أي وقت، على الرغم من أنه قد يتم الاحتفاظ ببعض المعلومات للامتثال القانوني.
fr: Nous conservons vos informations aussi longtemps que : • Votre compte est actif • Nécessaire pour fournir nos services • Requis par la loi ou pour des procédures judiciaires • Nécessaire pour la sécurité et la prévention de la fraude Vous pouvez demander la suppression de votre compte à tout moment, bien que certaines informations puissent être conservées pour la conformité légale.

# privacy_your_rights_title
source: 6. Your Rights and Choices
ar: 6. حقوقك واختياراتك
fr: 6. Vos droits et choix

# privacy_your_rights_content
source: You have the right to: • Access and review your personal information • Correct inaccurate or incomplete data • Delete your account and associated data To exercise these rights, contact us through the app or email.
ar: لديك الحق في: • الوصول إلى معلوماتك الشخصية ومراجعتها • تصحيح البيانات غير الدقيقة أو غير الكاملة • حذف حسابك والبيانات المرتبطة به لممارسة هذه الحقوق، اتصل بنا عبر التطبيق أو البريد الإلكتروني.
fr: Vous avez le droit de : • Accéder et consulter vos informations personnelles • Corriger les données inexactes ou incomplètes • Supprimer votre compte et les données associées Pour exercer ces droits, contactez-nous via l'application ou par email.

# privacy_children_title
source: 7. Children's Privacy
ar: 7. خصوصية الأطفال
fr: 7. Confidentialité des enfants

# privacy_children_content
source: Our service is not intended for users under 18 years of age. We do not knowingly collect personal information from children under 18. If we become aware of such collection, we will delete the information immediately.
ar: خدمتنا غير مخصصة للمستخدمين الذين تقل أعمارهم عن 18 عامًا. نحن لا نجمع عن قصد معلومات شخصية من الأطفال دون سن 18 عامًا. إذا علمنا بمثل هذا الجمع، فسنحذف المعلومات على الفور.
fr: Notre service n'est pas destiné aux utilisateurs de moins de 18 ans. Nous ne collectons pas sciemment d'informations personnelles auprès d'enfants de moins de 18 ans. Si nous prenons connaissance d'une telle collecte, nous supprimerons immédiatement les informations.

# privacy_international_title
source: 8. International Data Transfers
ar: 8. نقل البيانات الدولية
fr: 8. Transferts internationaux de données

# privacy_international_content
source: Your information may be transferred to and processed in countries other than your own. We ensure appropriate safeguards are in place to protect your data in accordance with this Privacy Policy.
ar: قد يتم نقل معلوماتك ومعالجتها في بلدان أخرى غير بلدك. نحن نضمن وجود ضمانات مناسبة لحماية بياناتك وفقًا لسياسة الخصوصية هذه.
fr: Vos informations peuvent être transférées et traitées dans des pays autres que le vôtre. Nous veillons à ce que des garanties appropriées soient en place pour protéger vos données conformément à cette politique de confidentialité.

# privacy_third_party_title
source: 9. Third-Party Services
ar: 9. خدمات الطرف الثالث
fr: 9. Services tiers

# privacy_third_party_content
source: Our app may contain links to third-party services or integrate with external platforms. This Privacy Policy does not cover third-party practices. Please review their privacy policies separately.
ar: قد يحتوي تطبيقنا على روابط لخدمات طرف ثالث أو يتكامل مع منصات خارجية. لا تغطي سياسة الخصوصية هذه ممارسات الطرف الثالث. يرجى مراجعة سياسات الخصوصية الخاصة بهم بشكل منفصل.
fr: Notre application peut contenir des liens vers des services tiers ou s'intégrer à des plateformes externes. Cette politique de confidentialité ne couvre pas les pratiques tierces. Veuillez consulter leurs politiques de confidentialité séparément.

# privacy_changes_title
source: 10. Changes to This Policy
ar: 10. التغييرات على هذه السياسة
fr: 10. Modifications de cette politique
